inference/load_testing/vegeta/text_gen/classification/falcon/exp1.txt
Requests      [total, rate, throughput]         5, 6.25, 3.69
Duration      [total, attack, wait]             1.355s, 800.005ms, 555.436ms
Latencies     [min, mean, 50, 90, 95, 99, max]  502.381ms, 550.005ms, 555.436ms, 595.686ms, 595.686ms, 595.686ms, 595.686ms
Bytes In      [total, mean]                     215, 43.00
Bytes Out     [total, mean]                     4555, 911.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 2.62
Duration      [total, attack, wait]             1.911s, 799.981ms, 1.111s
Latencies     [min, mean, 50, 90, 95, 99, max]  679.062ms, 820.98ms, 718.538ms, 1.111s, 1.111s, 1.111s, 1.111s
Bytes In      [total, mean]                     486, 97.20
Bytes Out     [total, mean]                     80, 16.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 2.62
Duration      [total, attack, wait]             1.91s, 799.973ms, 1.11s
Latencies     [min, mean, 50, 90, 95, 99, max]  678.315ms, 820.181ms, 717.818ms, 1.11s, 1.11s, 1.11s, 1.11s
Bytes In      [total, mean]                     445, 89.00
Bytes Out     [total, mean]                     90, 18.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 8.62
Duration      [total, attack, wait]             1.739s, 933.297ms, 805.836ms
Latencies     [min, mean, 50, 90, 95, 99, max]  805.693ms, 985.68ms, 971.039ms, 1.139s, 1.189s, 1.206s, 1.206s
Bytes In      [total, mean]                     1230, 82.00
Bytes Out     [total, mean]                     4050, 270.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 8.77
Duration      [total, attack, wait]             1.71s, 933.342ms, 776.453ms
Latencies     [min, mean, 50, 90, 95, 99, max]  751.038ms, 917.976ms, 909.041ms, 1.11s, 1.16s, 1.176s, 1.176s
Bytes In      [total, mean]                     975, 65.00
Bytes Out     [total, mean]                     2715, 181.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 10.63
Duration      [total, attack, wait]             1.411s, 933.356ms, 477.713ms
Latencies     [min, mean, 50, 90, 95, 99, max]  358.816ms, 620.428ms, 610.92ms, 809.51ms, 859.63ms, 876.337ms, 876.337ms
Bytes In      [total, mean]                     480, 32.00
Bytes Out     [total, mean]                     14025, 935.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 9.38
Duration      [total, attack, wait]             2.664s, 959.957ms, 1.704s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.078s, 1.378s, 1.399s, 1.518s, 1.595s, 1.704s, 1.704s
Bytes In      [total, mean]                     1950, 78.00
Bytes Out     [total, mean]                     11400, 456.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 12.44
Duration      [total, attack, wait]             2.01s, 959.969ms, 1.05s
Latencies     [min, mean, 50, 90, 95, 99, max]  695.585ms, 948.444ms, 873.119ms, 1.25s, 1.3s, 1.33s, 1.33s
Bytes In      [total, mean]                     1850, 74.00
Bytes Out     [total, mean]                     1100, 44.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25
Error Set:
Requests      [total, rate, throughput]         25, 26.04, 10.92
Duration      [total, attack, wait]             2.289s, 960ms, 1.329s
Latencies     [min, mean, 50, 90, 95, 99, max]  862.728ms, 1.259s, 1.307s, 1.529s, 1.579s, 1.609s, 1.609s
Bytes In      [total, mean]                     1075, 43.00
Bytes Out     [total, mean]                     22775, 911.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:25
Error Set:
Requests      [total, rate, throughput]         35, 36.03, 7.74
Duration      [total, attack, wait]             4.525s, 971.427ms, 3.553s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.266s, 2.27s, 2.279s, 3.32s, 3.37s, 3.553s, 3.553s
Bytes In      [total, mean]                     1645, 47.00
Bytes Out     [total, mean]                     46970, 1342.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:35
Error Set:
Requests      [total, rate, throughput]         35, 36.03, 18.09
Duration      [total, attack, wait]             1.935s, 971.403ms, 963.767ms
Latencies     [min, mean, 50, 90, 95, 99, max]  962.648ms, 1.203s, 1.209s, 1.364s, 1.413s, 1.449s, 1.449s
Bytes In      [total, mean]                     2275, 65.00
Bytes Out     [total, mean]                     6335, 181.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:35
Error Set:
Requests      [total, rate, throughput]         35, 36.03, 7.74
Duration      [total, attack, wait]             4.522s, 971.387ms, 3.551s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.264s, 2.267s, 2.276s, 3.318s, 3.368s, 3.551s, 3.551s
Bytes In      [total, mean]                     1645, 47.00
Bytes Out     [total, mean]                     46970, 1342.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:35
Error Set:
Requests      [total, rate, throughput]         45, 46.02, 19.40
Duration      [total, attack, wait]             2.32s, 977.783ms, 1.342s
Latencies     [min, mean, 50, 90, 95, 99, max]  731.219ms, 901.618ms, 864.111ms, 1.064s, 1.114s, 1.342s, 1.342s
Bytes In      [total, mean]                     4005, 89.00
Bytes Out     [total, mean]                     810, 18.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:45
Error Set:
Requests      [total, rate, throughput]         45, 46.02, 19.38
Duration      [total, attack, wait]             2.322s, 977.802ms, 1.344s
Latencies     [min, mean, 50, 90, 95, 99, max]  733.971ms, 903.863ms, 866.776ms, 1.067s, 1.117s, 1.344s, 1.344s
Bytes In      [total, mean]                     4365, 97.00
Bytes Out     [total, mean]                     720, 16.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:45
Error Set:
Requests      [total, rate, throughput]         45, 46.02, 26.05
Duration      [total, attack, wait]             1.728s, 977.755ms, 749.872ms
Latencies     [min, mean, 50, 90, 95, 99, max]  749.574ms, 919.371ms, 882.77ms, 1.105s, 1.155s, 1.194s, 1.194s
Bytes In      [total, mean]                     3330, 74.00
Bytes Out     [total, mean]                     1980, 44.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:45
Error Set:
Requests      [total, rate, throughput]         55, 56.02, 31.03
Duration      [total, attack, wait]             1.772s, 981.727ms, 790.649ms
Latencies     [min, mean, 50, 90, 95, 99, max]  773.904ms, 953.308ms, 927.486ms, 1.127s, 1.167s, 1.207s, 1.208s
Bytes In      [total, mean]                     4070, 74.00
Bytes Out     [total, mean]                     2420, 44.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:55
Error Set:
Requests      [total, rate, throughput]         55, 56.02, 23.51
Duration      [total, attack, wait]             2.34s, 981.8ms, 1.358s
Latencies     [min, mean, 50, 90, 95, 99, max]  744.28ms, 925.546ms, 889.721ms, 1.125s, 1.176s, 1.35s, 1.358s
Bytes In      [total, mean]                     5376, 97.75
Bytes Out     [total, mean]                     880, 16.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:55
Error Set:
Requests      [total, rate, throughput]         55, 56.02, 14.45
Duration      [total, attack, wait]             3.806s, 981.822ms, 2.824s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.034s, 2.087s, 1.88s, 2.843s, 2.892s, 2.933s, 2.933s
Bytes In      [total, mean]                     1760, 32.00
Bytes Out     [total, mean]                     51425, 935.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:55
Error Set:
Requests      [total, rate, throughput]         65, 66.01, 37.46
Duration      [total, attack, wait]             1.735s, 984.683ms, 750.702ms
Latencies     [min, mean, 50, 90, 95, 99, max]  750.663ms, 924.501ms, 896.54ms, 1.096s, 1.138s, 1.177s, 1.18s
Bytes In      [total, mean]                     5785, 89.00
Bytes Out     [total, mean]                     1170, 18.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:65
Error Set:
Requests      [total, rate, throughput]         65, 66.02, 14.78
Duration      [total, attack, wait]             4.399s, 984.591ms, 3.415s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.11s, 2.265s, 2.106s, 3.491s, 3.541s, 3.581s, 3.583s
Bytes In      [total, mean]                     2080, 32.00
Bytes Out     [total, mean]                     60775, 935.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:65
Error Set:
Requests      [total, rate, throughput]         65, 66.01, 14.38
Duration      [total, attack, wait]             4.52s, 984.663ms, 3.536s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.17s, 2.49s, 2.206s, 3.328s, 3.54s, 3.58s, 3.582s
Bytes In      [total, mean]                     3705, 57.00
Bytes Out     [total, mean]                     40040, 616.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:65
Error Set:
Requests      [total, rate, throughput]         75, 76.02, 0.00
Duration      [total, attack, wait]             987.069ms, 986.619ms, 449.266µs
Latencies     [min, mean, 50, 90, 95, 99, max]  258.684µs, 345.601µs, 306.454µs, 417.795µs, 516.775µs, 1.073ms, 1.237ms
Bytes In      [total, mean]                     6300, 84.00
Bytes Out     [total, mean]                     25725, 343.00
Success       [ratio]                           0.00%
Status Codes  [code:count]                      400:75
Error Set:
400 Bad Request
Requests      [total, rate, throughput]         75, 76.01, 11.53
Duration      [total, attack, wait]             6.505s, 986.659ms, 5.518s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.667s, 3.395s, 2.938s, 5.131s, 5.542s, 5.582s, 5.585s
Bytes In      [total, mean]                     3225, 43.00
Bytes Out     [total, mean]                     68325, 911.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:75
Error Set:
Requests      [total, rate, throughput]         75, 76.01, 8.28
Duration      [total, attack, wait]             9.056s, 986.65ms, 8.07s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.835s, 4.561s, 4.1s, 7.338s, 8.093s, 8.133s, 8.136s
Bytes In      [total, mean]                     3525, 47.00
Bytes Out     [total, mean]                     100650, 1342.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:75
Error Set:
Requests      [total, rate, throughput]         85, 86.01, 44.34
Duration      [total, attack, wait]             1.917s, 988.266ms, 928.703ms
Latencies     [min, mean, 50, 90, 95, 99, max]  828.551ms, 1.065s, 1.054s, 1.28s, 1.33s, 1.37s, 1.374s
Bytes In      [total, mean]                     6290, 74.00
Bytes Out     [total, mean]                     3740, 44.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:85
Error Set:
Requests      [total, rate, throughput]         85, 86.01, 47.06
Duration      [total, attack, wait]             1.806s, 988.235ms, 817.808ms
Latencies     [min, mean, 50, 90, 95, 99, max]  787.451ms, 973.281ms, 946.676ms, 1.147s, 1.196s, 1.236s, 1.24s
Bytes In      [total, mean]                     7565, 89.00
Bytes Out     [total, mean]                     1530, 18.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:85
Error Set:
Requests      [total, rate, throughput]         85, 86.01, 4.22
Duration      [total, attack, wait]             20.16s, 988.234ms, 19.171s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.517s, 10.27s, 9.724s, 17.849s, 19.186s, 19.226s, 19.23s
Bytes In      [total, mean]                     7820, 92.00
Bytes Out     [total, mean]                     166430, 1958.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:85
Error Set:
Requests      [total, rate, throughput]         95, 96.02, 48.06
Duration      [total, attack, wait]             1.977s, 989.411ms, 987.102ms
Latencies     [min, mean, 50, 90, 95, 99, max]  878.683ms, 1.115s, 1.107s, 1.306s, 1.35s, 1.39s, 1.395s
Bytes In      [total, mean]                     7030, 74.00
Bytes Out     [total, mean]                     4180, 44.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:95
Error Set:
Requests      [total, rate, throughput]         95, 96.01, 11.73
Duration      [total, attack, wait]             8.101s, 989.483ms, 7.112s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.798s, 4.186s, 4.144s, 6.513s, 7.151s, 7.191s, 7.196s
Bytes In      [total, mean]                     4085, 43.00
Bytes Out     [total, mean]                     86545, 911.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:95
Error Set:
Requests      [total, rate, throughput]         95, 96.02, 30.73
Duration      [total, attack, wait]             3.092s, 989.373ms, 2.102s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.343s, 1.785s, 1.715s, 2.26s, 2.31s, 2.35s, 2.354s
Bytes In      [total, mean]                     6175, 65.00
Bytes Out     [total, mean]                     17195, 181.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:95
Error Set:
Requests      [total, rate, throughput]         105, 106.01, 15.40
Duration      [total, attack, wait]             6.817s, 990.443ms, 5.827s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.486s, 3.564s, 3.85s, 5.855s, 5.905s, 5.945s, 5.951s
Bytes In      [total, mean]                     5985, 57.00
Bytes Out     [total, mean]                     64680, 616.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:105
Error Set:
Requests      [total, rate, throughput]         105, 106.01, 8.10
Duration      [total, attack, wait]             12.966s, 990.452ms, 11.975s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.235s, 6.476s, 6.832s, 11.322s, 11.372s, 11.999s, 12.004s
Bytes In      [total, mean]                     4935, 47.00
Bytes Out     [total, mean]                     140910, 1342.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:105
Error Set:
Requests      [total, rate, throughput]         105, 106.01, 54.56
Duration      [total, attack, wait]             1.924s, 990.484ms, 934ms
Latencies     [min, mean, 50, 90, 95, 99, max]  43.101ms, 748.044ms, 797.233ms, 1.191s, 1.24s, 1.28s, 1.285s
Bytes In      [total, mean]                     2205, 21.00
Bytes Out     [total, mean]                     28770, 274.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:105
Error Set:
Requests      [total, rate, throughput]         115, 116.01, 61.56
Duration      [total, attack, wait]             1.868s, 991.271ms, 876.735ms
Latencies     [min, mean, 50, 90, 95, 99, max]  816.818ms, 1.023s, 998.446ms, 1.241s, 1.29s, 1.33s, 1.336s
Bytes In      [total, mean]                     11229, 97.64
Bytes Out     [total, mean]                     1840, 16.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:115
Error Set:
Requests      [total, rate, throughput]         115, 116.01, 17.23
Duration      [total, attack, wait]             6.676s, 991.255ms, 5.685s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.709s, 3.644s, 3.286s, 5.78s, 5.83s, 5.87s, 5.876s
Bytes In      [total, mean]                     8970, 78.00
Bytes Out     [total, mean]                     52440, 456.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:115
Error Set:
Requests      [total, rate, throughput]         115, 116.01, 8.11
Duration      [total, attack, wait]             14.18s, 991.255ms, 13.189s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.242s, 7.083s, 6.926s, 12.521s, 12.571s, 13.209s, 13.215s
Bytes In      [total, mean]                     5405, 47.00
Bytes Out     [total, mean]                     154330, 1342.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:115
Error Set:
Requests      [total, rate, throughput]         125, 126.01, 53.13
Duration      [total, attack, wait]             2.353s, 991.959ms, 1.361s
Latencies     [min, mean, 50, 90, 95, 99, max]  42.836ms, 1.005s, 1.199s, 1.478s, 1.502s, 1.522s, 1.528s
Bytes In      [total, mean]                     2625, 21.00
Bytes Out     [total, mean]                     34250, 274.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:125
Error Set:
Requests      [total, rate, throughput]         125, 126.01, 53.13
Duration      [total, attack, wait]             2.353s, 991.959ms, 1.361s
Latencies     [min, mean, 50, 90, 95, 99, max]  42.836ms, 1.005s, 1.199s, 1.478s, 1.502s, 1.522s, 1.528s
Bytes In      [total, mean]                     2625, 21.00
Bytes Out     [total, mean]                     34250, 274.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:125
Error Set:
Requests      [total, rate, throughput]         125, 126.02, 16.16
Duration      [total, attack, wait]             7.735s, 991.923ms, 6.743s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.751s, 3.924s, 3.363s, 6.146s, 6.195s, 6.761s, 6.767s
Bytes In      [total, mean]                     9750, 78.00
Bytes Out     [total, mean]                     57000, 456.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:125
Error Set:
Requests      [total, rate, throughput]         125, 126.01, 65.87
Duration      [total, attack, wait]             1.898s, 991.97ms, 905.602ms
Latencies     [min, mean, 50, 90, 95, 99, max]  839.166ms, 1.05s, 1.025s, 1.272s, 1.322s, 1.361s, 1.367s
Bytes In      [total, mean]                     11125, 89.00
Bytes Out     [total, mean]                     2250, 18.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:125
Error Set: